import pandas as pd
import pytest


@pytest.fixture
def transactions():
    data = [
        {"Описание": "Оплата кафе", "Категория": "Еда"},
        {"Описание": "Такси", "Категория": "Транспорт"},
        {"Описание": "Покупка книги", "Категория": "Развлечения"},
    ]
    return data


@pytest.fixture
def test_dataframe():
    data = [
        {"Дата операции": "01.06.2025 10:00:00", "Категория": "Еда", "Сумма платежа": -100},
        {"Дата операции": "15.07.2025 12:00:00", "Категория": "Транспорт", "Сумма платежа": -50},
        {"Дата операции": "20.08.2025 15:30:00", "Категория": "Еда", "Сумма платежа": -200},
    ]
    return pd.DataFrame(data)
